; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l5-t1-p4---int100n150-m25---int100c150---s38---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 l3 l4 - location
t0 - truck
p0 p1 p2 p3 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 - fuellevel
)

(:init
(sum level0 level2 level2)
(sum level0 level6 level6)
(sum level0 level9 level9)
(sum level0 level10 level10)
(sum level0 level16 level16)
(sum level0 level18 level18)
(sum level1 level2 level3)
(sum level1 level6 level7)
(sum level1 level9 level10)
(sum level1 level10 level11)
(sum level1 level16 level17)
(sum level1 level18 level19)
(sum level2 level2 level4)
(sum level2 level6 level8)
(sum level2 level9 level11)
(sum level2 level10 level12)
(sum level2 level16 level18)
(sum level2 level18 level20)
(sum level3 level2 level5)
(sum level3 level6 level9)
(sum level3 level9 level12)
(sum level3 level10 level13)
(sum level3 level16 level19)
(sum level3 level18 level21)
(sum level4 level2 level6)
(sum level4 level6 level10)
(sum level4 level9 level13)
(sum level4 level10 level14)
(sum level4 level16 level20)
(sum level4 level18 level22)
(sum level5 level2 level7)
(sum level5 level6 level11)
(sum level5 level9 level14)
(sum level5 level10 level15)
(sum level5 level16 level21)
(sum level5 level18 level23)
(sum level6 level2 level8)
(sum level6 level6 level12)
(sum level6 level9 level15)
(sum level6 level10 level16)
(sum level6 level16 level22)
(sum level6 level18 level24)
(sum level7 level2 level9)
(sum level7 level6 level13)
(sum level7 level9 level16)
(sum level7 level10 level17)
(sum level7 level16 level23)
(sum level7 level18 level25)
(sum level8 level2 level10)
(sum level8 level6 level14)
(sum level8 level9 level17)
(sum level8 level10 level18)
(sum level8 level16 level24)
(sum level8 level18 level26)
(sum level9 level2 level11)
(sum level9 level6 level15)
(sum level9 level9 level18)
(sum level9 level10 level19)
(sum level9 level16 level25)
(sum level9 level18 level27)
(sum level10 level2 level12)
(sum level10 level6 level16)
(sum level10 level9 level19)
(sum level10 level10 level20)
(sum level10 level16 level26)
(sum level10 level18 level28)
(sum level11 level2 level13)
(sum level11 level6 level17)
(sum level11 level9 level20)
(sum level11 level10 level21)
(sum level11 level16 level27)
(sum level11 level18 level29)
(sum level12 level2 level14)
(sum level12 level6 level18)
(sum level12 level9 level21)
(sum level12 level10 level22)
(sum level12 level16 level28)
(sum level12 level18 level30)
(sum level13 level2 level15)
(sum level13 level6 level19)
(sum level13 level9 level22)
(sum level13 level10 level23)
(sum level13 level16 level29)
(sum level13 level18 level31)
(sum level14 level2 level16)
(sum level14 level6 level20)
(sum level14 level9 level23)
(sum level14 level10 level24)
(sum level14 level16 level30)
(sum level14 level18 level32)
(sum level15 level2 level17)
(sum level15 level6 level21)
(sum level15 level9 level24)
(sum level15 level10 level25)
(sum level15 level16 level31)
(sum level15 level18 level33)
(sum level16 level2 level18)
(sum level16 level6 level22)
(sum level16 level9 level25)
(sum level16 level10 level26)
(sum level16 level16 level32)
(sum level16 level18 level34)
(sum level17 level2 level19)
(sum level17 level6 level23)
(sum level17 level9 level26)
(sum level17 level10 level27)
(sum level17 level16 level33)
(sum level17 level18 level35)
(sum level18 level2 level20)
(sum level18 level6 level24)
(sum level18 level9 level27)
(sum level18 level10 level28)
(sum level18 level16 level34)
(sum level18 level18 level36)
(sum level19 level2 level21)
(sum level19 level6 level25)
(sum level19 level9 level28)
(sum level19 level10 level29)
(sum level19 level16 level35)
(sum level19 level18 level37)
(sum level20 level2 level22)
(sum level20 level6 level26)
(sum level20 level9 level29)
(sum level20 level10 level30)
(sum level20 level16 level36)
(sum level20 level18 level38)
(sum level21 level2 level23)
(sum level21 level6 level27)
(sum level21 level9 level30)
(sum level21 level10 level31)
(sum level21 level16 level37)
(sum level21 level18 level39)
(sum level22 level2 level24)
(sum level22 level6 level28)
(sum level22 level9 level31)
(sum level22 level10 level32)
(sum level22 level16 level38)
(sum level23 level2 level25)
(sum level23 level6 level29)
(sum level23 level9 level32)
(sum level23 level10 level33)
(sum level23 level16 level39)
(sum level24 level2 level26)
(sum level24 level6 level30)
(sum level24 level9 level33)
(sum level24 level10 level34)
(sum level25 level2 level27)
(sum level25 level6 level31)
(sum level25 level9 level34)
(sum level25 level10 level35)
(sum level26 level2 level28)
(sum level26 level6 level32)
(sum level26 level9 level35)
(sum level26 level10 level36)
(sum level27 level2 level29)
(sum level27 level6 level33)
(sum level27 level9 level36)
(sum level27 level10 level37)
(sum level28 level2 level30)
(sum level28 level6 level34)
(sum level28 level9 level37)
(sum level28 level10 level38)
(sum level29 level2 level31)
(sum level29 level6 level35)
(sum level29 level9 level38)
(sum level29 level10 level39)
(sum level30 level2 level32)
(sum level30 level6 level36)
(sum level30 level9 level39)
(sum level31 level2 level33)
(sum level31 level6 level37)
(sum level32 level2 level34)
(sum level32 level6 level38)
(sum level33 level2 level35)
(sum level33 level6 level39)
(sum level34 level2 level36)
(sum level35 level2 level37)
(sum level36 level2 level38)
(sum level37 level2 level39)

(connected l0 l1)
(fuelcost level18 l0 l1)
(connected l0 l2)
(fuelcost level10 l0 l2)
(connected l0 l3)
(fuelcost level16 l0 l3)
(connected l0 l4)
(fuelcost level2 l0 l4)
(connected l1 l0)
(fuelcost level18 l1 l0)
(connected l1 l4)
(fuelcost level2 l1 l4)
(connected l2 l0)
(fuelcost level10 l2 l0)
(connected l2 l3)
(fuelcost level9 l2 l3)
(connected l3 l0)
(fuelcost level16 l3 l0)
(connected l3 l2)
(fuelcost level9 l3 l2)
(connected l3 l4)
(fuelcost level6 l3 l4)
(connected l4 l0)
(fuelcost level2 l4 l0)
(connected l4 l1)
(fuelcost level2 l4 l1)
(connected l4 l3)
(fuelcost level6 l4 l3)

(at t0 l4)
(fuel t0 level39)
(= (total-cost) 0)

(at p0 l4)
(at p1 l4)
(at p2 l2)
(at p3 l2)
)

(:goal
(and
(at p0 l1)
(at p1 l1)
(at p2 l1)
(at p3 l0)
)
)
(:metric minimize (total-cost)))

; plan
1. (drive t0 l4 l3 level33 level6 level39)
   deleted: (at t0 l4) (fuel t0 level39)
   added: (at t0 l3) (fuel t0 level33)
   goals met: 0 of 4
2. (drive t0 l3 l2 level24 level9 level33)
   deleted: (at t0 l3) (fuel t0 level33)
   added: (at t0 l2) (fuel t0 level24)
   goals met: 0 of 4
3. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 4
4. (load p2 t0 l2)
   deleted: (at p2 l2)
   added: (in p2 t0)
   goals met: 0 of 4
5. (drive t0 l2 l0 level14 level10 level24)
   deleted: (at t0 l2) (fuel t0 level24)
   added: (at t0 l0) (fuel t0 level14)
   goals met: 0 of 4
6. (unload p3 t0 l0)
   deleted: (in p3 t0)
   added: (at p3 l0)
   goals met: 1 of 4
7. (drive t0 l0 l4 level12 level2 level14)
   deleted: (at t0 l0) (fuel t0 level14)
   added: (at t0 l4) (fuel t0 level12)
   goals met: 1 of 4
8. (load p0 t0 l4)
   deleted: (at p0 l4)
   added: (in p0 t0)
   goals met: 1 of 4
9. (load p1 t0 l4)
   deleted: (at p1 l4)
   added: (in p1 t0)
   goals met: 1 of 4
10. (drive t0 l4 l1 level10 level2 level12)
   deleted: (at t0 l4) (fuel t0 level12)
   added: (at t0 l1) (fuel t0 level10)
   goals met: 1 of 4
11. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 4
12. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 3 of 4
13. (unload p2 t0 l1)
   deleted: (in p2 t0)
   added: (at p2 l1)
   goals met: 4 of 4
